{
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "model_type": "distilbert",
  "num_labels": 3,
  "id2label": {
    "0": "negative",
    "1": "neutral",
    "2": "positive"
  },
  "label2id": {
    "negative": 0,
    "neutral": 1,
    "positive": 2
  }
}